blog.org
#+hugo_base_dir: .
#+hugo_section: ./posts
#+org-hugo-footer: ""
#+hugo_weight: auto
#+hugo_front_matter_format: yaml
#+hugo_auto_set_lastmod: t
#+author:

** DONE Installing Haskell
:PROPERTIES:
:EXPORT_FILE_NAME: Installing-Haskell.md
:EXPORT_DATE: 2019-05-25
:EXPORT_HUGO_CUSTOM_FRONT_MATTER:
:END:

In this episode we will be installing Haskell, a lot of people struggle to install software to their machine and each operating system will be different, generally I advise the use of a package manger - not just to install Haskell, but to  install all software. I will be making a post about [[https://brew.sh/][Brew]] at some point which makes this process trivial.
*** MacOS

MacOS my operating system of choice, to install Haskell on a MacOS system, the best method is to use a package manager such as [[https://brew.sh/][Brew]].

1.  If you don't have [[https://brew.sh/][Brew]] installed, follow the link and install that. Brew is one of my essential utilities for any new Mac.
2.  Open your favourite terminal emulator such as ~Terminal.app~, pre-installed on all Macs.
3.  From your command line run, ~brew install ghc~, this will install the latest version of the _Glasgow Haskell Compiler_
4.  Happy Days! Haskell is now installed.
*** Linux

1.  Open your favourite terminal emulator such as ~Terminal~.
2.  Using your favourite package manager install ~ghc~, this will install the latest version of the _Glasgow Haskell Compiler_
3.  Happy Days! Haskell is now installed.
*** Windows
A lot of software we use in Computer Science does run on Windows, but it does not play nice, lets fix that.

1. If your don't have [[https://docs.microsoft.com/en-us/windows/wsl/install-win10][WSL (Windows Subsystem for Linux)]], go install that first
2. Congratulations, your avoiding Windows, now follow the Linux instructions.
